/*：1.洗牌：先实现将52张扑克进行洗牌。
定义一个一维数组，int a[52]将52张扑克分别作为0-51存储在数组中，使用sand((unsigned)time(NULL))；语句产生随机种子，使用rand()%52产生0-51的随机数。
使用循环判定使a[52]中的数从0-51随机分布。
2.发牌给选手：
定义4个一维数组，分别为zs[13],ls[13],ww[13],hh[13]用来存储参加游戏的四名选手。
将a[52]中的数据按照下标0-12，13-25,26-38,39-51分别赋值给以上四个数组。
3．显示出选手的扑克
假设扑克认定数字0-12为黑桃，数字13-25为红桃，数字26-38为方块，数字39-51为梅花。定义一个花色数组为int fs[4]={6,3,4,5};其中3红桃 4方片 5梅花 6核桃；定义一个扑克数组char pk[13]={‘2’,’3’,’4’,’5’,’6’,’7’,’8’,’9’,’0’,’J’,’Q’,’K’,’A’};其中’0’代表扑克10；使用方法使每个人显示出扑克的花色和数字。
4.对每个参赛选手进行扑克排序，然后按照从小到大的顺序输出其扑克。
*/
#include<time.h>
int main()
{
	printf("有52张牌\n");
	int a[52];
	int i;
	for(i=0;i<52;i++)
	{
		a[i]=i;
		printf("%d ",a[i]);
	}
	printf("\n随机生成52张牌\n");
	int c,b,temp;
	srand((unsigned)time(NULL));
	for(i=0;i<52;i++)
	{
	c=rand()%52;
	a[i]=c;	
	printf("%d ",a[i]);
	}
	printf("\n洗牌结束\n");
	
	int zs[13],ls[13],ww[13],ml[13],x=0;
	for(i=0;i<52;i++)
	{
		if(i<13)
		{
			zs[x]=a[i];
			x++;
			printf("%d ",zs[x]);
		}
		if(i>=13&&i<26)
		{
			ls[x]=a[i];
			x++;
			printf("%d ",ls[x]);
		}
		if(i>=26&&i<39)
		{
			ww[x]=a[i];
			x++;
			printf("%d ",ww[x]);
		}
		if(i>=39&&i<52)
		{
			ml[x]=a[i];
			x++;
			printf("%d ",zs[x]);
		}
	}
	
	return 0;
}
